In [2]:
import pandas as pd
df=pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [4]:
inputs =df.drop('Survived',axis='columns')
target =df.Survived

In [8]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [9]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [10]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [11]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [12]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [13]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [14]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(inputs,target,test_size=0.3)

In [15]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()
model.fit(X_train,y_train)

GaussianNB()

In [16]:
model.score(X_test,y_test)

0.7611940298507462

In [17]:
X_test[0:10]

     Pclass        Age      Fare  female
187       1  45.000000   26.5500       0
531       3  29.699118    7.2292       0
874       2  28.000000   24.0000       1
541       3   9.000000   31.2750       1
259       2  50.000000   26.0000       1
41        2  27.000000   21.0000       1
269       1  35.000000  135.6333       1
384       3  29.699118    7.8958       0
250       3  29.699118    7.2500       0
710       1  24.000000   49.5042       1

In [18]:
y_test[0:10]

187    1
531    0
874    1
541    0
259    1
41     0
269    1
384    0
250    0
710    1
Name: Survived, dtype: int64

In [19]:
model.predict(X_test[0:10])

array([0, 0, 1, 1, 1, 1, 1, 0, 0, 1], dtype=int64)

In [20]:
model.predict_proba(X_test[:10])

array([[8.07410151e-01, 1.92589849e-01],
       [9.67287664e-01, 3.27123361e-02],
       [2.14848025e-01, 7.85151975e-01],
       [2.57982795e-01, 7.42017205e-01],
       [2.27897938e-01, 7.72102062e-01],
       [2.15498544e-01, 7.84501456e-01],
       [3.97633424e-04, 9.99602367e-01],
       [9.67378570e-01, 3.26214304e-02],
       [9.67290660e-01, 3.27093405e-02],
       [4.73073387e-02, 9.52692661e-01]])

In [21]:
#Calculate the score using validation
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.752     , 0.824     , 0.76      , 0.80645161, 0.78225806])